In [4]:
from io import StringIO

import pandas as pd

# create df from string
TESTDATA = StringIO("""col1,col2,col3
    1,4.4,99
    2,,200
    3,4.7,65
    4,3.2,
    """)

df = pd.read_csv(TESTDATA)

In [6]:
df # blank value is presented as NaN

   col1  col2   col3
0     1   4.4   99.0
1     2   NaN  200.0
2     3   4.7   65.0
3     4   3.2    NaN

In [8]:
# Drop the rows where at least one element is missing.
df.dropna()

   col1  col2  col3
0     1   4.4  99.0
2     3   4.7  65.0

In [9]:
# Drop the columns where at least one element is missing.
df.dropna(axis='columns')

   col1
0     1
1     2
2     3
3     4